#+title: My Emacs Settings
#+author: Keisuke Nakasuga

* パッケージ管理
** レポジトリを登録する
#+begin_src emacs-lisp
  (require 'package)
  (setq package-archives
	'(("melpa" . "https://melpa.org/packages/")
	  ;; ("melpa-stable" . "https://stable.melpa.org/packages/")
	  ("org" . "https://orgmode.org/elpa/")
	  ("gnu" . "https://elpa.gnu.org/packages/")))
  (package-initialize)
#+end_src

** use-package
#+begin_src emacs-lisp
  (use-package use-package
      :config
      (setq use-package-always-ensure t))
#+end_src

** dashboard
起動画面を便利にしてくれる。
#+begin_src emacs-lisp
  (use-package dashboard
    :ensure t
    :config
    (dashboard-setup-startup-hook))
#+end_src

** org-mode用の関数
*** org-modeのコードブロックを編集、保存したときインデントを自動で整形する
#+begin_src emacs-lisp
  (defun org-babel-auto-format-code-blocks ()
    (interactive)
    (when (org-in-src-block-p)
      (let* ((element  (org-element-at-point))
	     (language (org-element-property :language element))
	     (start    (org-element-property :begin element))
	     (end      (org-element-property :end element)))
	(save-restriction
	  (narrow-to-region start end)
	  (goto-char start)
	  (forward-line)
	  (cond
	   ((string-equal language "emacs-lisp") (indent-region (point) (point-max)))
	   ((string-equal language "python")     (python-indent-region (point) (point-max))))))))
#+end_src

** org
#+begin_src emacs-lisp
  (use-package org
    :ensure t
    :hook
    ((org-mode . (lambda () (add-hook 'before-save-hook 'org-babel-auto-format-code-blocks nil 'local))))
    :config
    (setq org-babel-python-command "python3")
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((python . t))))
#+end_src

** org-modern
https://github.com/minad/org-modern

#+begin_src emacs-lisp
  (use-package org-modern
    :ensure t
    :hook ((org-mode . org-modern-mode)
	   (org-agenda-finalize . org-modern-agenda)))
#+end_src

** perfect-margin
https://github.com/mpwang/perfect-margin

#+begin_src emacs-lisp
  (use-package perfect-margin
     :ensure t
     :config
     (perfect-margin-mode 1))
#+end_src

** spacious-padding
#+begin_src emacs-lisp
  (use-package spacious-padding
    :ensure t)
#+end_src

** yes-noをy-nに変更
#+begin_src emacs-lisp
  (setq use-short-answers t)
#+end_src

** バックアップファイルを作成しない
#+begin_src emacs-lisp
  (setq make-backup-files nil)
  (setq backup-inhibited nil)
  (setq create-lockfiles nil)
#+end_src

** 末尾のタブ・スペースを可視化する
#+begin_src emacs-lisp
  (setq-default show-trailing-whitespace t)
#+end_src

** ビープ音を消す
#+begin_src emacs-lisp
  (setq ring-bell-function 'ignore)
#+end_src

** テーマ
#+BEGIN_SRC emacs-lisp
  (use-package ef-themes
    :config
    (setq ef-themes-mixed-fonts t
	  ef-themes-variable-pitch-ui t)
    (load-theme 'ef-night t))
#+END_SRC

* フォント
事前に「JetBrainsMono」「PlemolJP」を端末にインストールしておくこと。
*** JetBrains Mono
https://www.jetbrains.com/ja-jp/lp/mono/
*** PlemolJP
https://github.com/yuru7/PlemolJP?tab=readme-ov-file

#+begin_src emacs-lisp
    ;;  (custom-set-faces
    ;;     '(default ((t (:foundry "JetBrains Mono-10" :family "JetBrains Mono-10")))))
    ;; (set-default-face "JetBrains Mono-10")
    (set-face-attribute 'default nil
			:family "JetBrains Mono"
		        :height 110)
#+end_src

* 言語
#+begin_src python :results output
  def test():
      return 1 + 1;

  print(test())
  #+end_src

#+RESULTS:
: 2
